In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_csv("loan_default.csv")

In [5]:
df.head()

,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,DAYS_BIRTH,YEARS_EMPLOYED
0,0.0,Cash loans,M,Y,N,1,225000.0,578619.0,23229.0,-12347,0
1,0.0,Revolving loans,M,Y,Y,1,NaN,270000.0,13500.0,-14048,6
2,0.0,Cash loans,M,Y,N,0,144000.0,753840.0,29340.0,-14639,6
3,0.0,Cash loans,F,N,Y,0,81000.0,98910.0,7785.0,-14591,11
4,0.0,Cash loans,F,N,Y,1,103500.0,521280.0,26779.5,-12023,0

In [6]:
print("\nShape of the dataset:")
print(f"There are {df.shape[0]} rows and {df.shape[1]} columns.")
df.shape

Shape of the dataset:
There are 10284 rows and 11 columns.

(10284, 11)

In [7]:
#summary_statistics
df.describe().T

,count,mean,std,min,25%,50%,75%,max
TARGET,10281.0,0.079078,0.269873,0.0,0.000,0.0,0.0,1.0
CNT_CHILDREN,10284.0,10.287340,986.138233,0.0,0.000,0.0,1.0,99999.0
AMT_INCOME_TOTAL,6993.0,167909.947902,105245.713874,27000.0,112500.000,144000.0,202500.0,3825000.0
AMT_CREDIT,10284.0,599902.578326,400843.758473,45000.0,270000.000,512446.5,810000.0,4050000.0
AMT_ANNUITY,10284.0,27191.230747,14933.326225,2974.5,16509.375,25128.0,34596.0,258025.5
DAYS_BIRTH,10284.0,-16055.232400,4377.738214,-25166.0,-19724.250,-15733.5,-12352.0,-7680.0
YEARS_EMPLOYED,10284.0,-176.848016,388.125395,-1000.0,0.000,3.0,7.0,150.0

In [8]:
print("\nMissing Values in Each Column:")
print(df.isnull().sum())

Missing Values in Each Column:
TARGET                   3
NAME_CONTRACT_TYPE       0
CODE_GENDER              0
FLAG_OWN_CAR          2262
FLAG_OWN_REALTY         30
CNT_CHILDREN             0
AMT_INCOME_TOTAL      3291
AMT_CREDIT               0
AMT_ANNUITY              0
DAYS_BIRTH               0
YEARS_EMPLOYED           0
dtype: int64

In [10]:
print("\nUnique Values in Each Column:")
print(df.nunique())

Unique Values in Each Column:
TARGET                   2
NAME_CONTRACT_TYPE       2
CODE_GENDER              2
FLAG_OWN_CAR             2
FLAG_OWN_REALTY          4
CNT_CHILDREN            13
AMT_INCOME_TOTAL       260
AMT_CREDIT            1860
AMT_ANNUITY           4279
DAYS_BIRTH            7604
YEARS_EMPLOYED          46
dtype: int64

In [12]:
df.FLAG_OWN_REALTY.unique()

array(['N', 'Y', nan, 'YES', 'NO'], dtype=object)

In [14]:
df['FLAG_OWN_REALTY'] = df['FLAG_OWN_REALTY'].replace({'YES': 'Y', 'NO': 'N'})

In [16]:
df.FLAG_OWN_REALTY.unique()

array(['N', 'Y', nan], dtype=object)

In [22]:
#handling missing values
#drop rows where target is null
df.dropna(subset = ['TARGET'], inplace = True)
#input missing values in 'Flag_Own_Car' with mode
car_mode = df['FLAG_OWN_CAR'].mode()[0]
df['FLAG_OWN_CAR'] = df['FLAG_OWN_CAR'].fillna(car_mode)
# Impute missing values in 'AMT_INCOME_TOTAL' with the median
income_median = df['AMT_INCOME_TOTAL'].median()
df['AMT_INCOME_TOTAL'] = df['AMT_INCOME_TOTAL'].fillna(income_median)
#Checking.....
print(df.isnull().sum())

TARGET                 0
NAME_CONTRACT_TYPE     0
CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY       30
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
AMT_CREDIT             0
AMT_ANNUITY            0
DAYS_BIRTH             0
YEARS_EMPLOYED         0
dtype: int64

In [28]:
df['FLAG_OWN_REALTY'].nunique()
df['FLAG_OWN_REALTY'].head()
df['FLAG_OWN_REALTY'].unique()

array(['N', 'Y', nan], dtype=object)

In [36]:
#Replace NAN with mode
own_reality_mode = df['FLAG_OWN_REALTY'].mode()[0]
df['FLAG_OWN_REALTY'] = df['FLAG_OWN_REALTY'].fillna(own_reality_mode)

In [42]:
df.head()

,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,DAYS_BIRTH,YEARS_EMPLOYED
0,0.0,Cash loans,M,Y,N,1,225000.0,578619.0,23229.0,-12347,0
1,0.0,Revolving loans,M,Y,Y,1,144000.0,270000.0,13500.0,-14048,6
2,0.0,Cash loans,M,Y,N,0,144000.0,753840.0,29340.0,-14639,6
3,0.0,Cash loans,F,N,Y,0,81000.0,98910.0,7785.0,-14591,11
4,0.0,Cash loans,F,N,Y,1,103500.0,521280.0,26779.5,-12023,0

In [46]:
df.isnull().sum()

TARGET                0
NAME_CONTRACT_TYPE    0
CODE_GENDER           0
FLAG_OWN_CAR          0
FLAG_OWN_REALTY       0
CNT_CHILDREN          0
AMT_INCOME_TOTAL      0
AMT_CREDIT            0
AMT_ANNUITY           0
DAYS_BIRTH            0
YEARS_EMPLOYED        0
dtype: int64